
// Haqq Shab-e Qadrast dar shab-hâ nehân
// tâ konad jân har shabi-râ emtehân
// Nah hameh shab-hâ bovad Qadr ay javân
// nah hameh shab-hâ bovad khâli az ân

const note_i = `
حق شب قدراست در شبها نهان
تا كند جان هر شب را امتهان
نه همه شبها بود قدر اط جوان
نه همه شبها بود خال از ان
`

const poem_i = `
قصه‌ی رنجور و رنجوری بخواند    بعد از آن در پیش رنجورش نشاند
رنگ روی و نبض و قاروره بدید    هم علاماتش هم اسبابش شنید
گفت هر دارو که ایشان کرده‌اند    آن عمارت نیست ویران کرده‌اند
بی‌خبر بودند از حال درون    استعیذ الله مما یفترون
دید رنج و کشف شد بروی نهفت    لیک پنهان کرد و با سلطان نگفت
رنجش از صفرا و از سودا نبود    بوی هر هیزم پدید آید ز دود
دید از زاری‌اش کو زار دل‌است    تن خوش‌است و او گرفتار دل‌است
عاشقی پیداست از زاری دل    نیست بیماری چو بیماری دل
علت عاشق ز علت‌ها جداست    عشق اصطرلاب اسرار خداست
عاشقی گر زین سر و گر زان سرست    عاقبت ما را بدان سر رهبرست
هرچه گویم عشق را شرح و بیان    چون به عشق آیم خجل باشم از آن
گرچه تفسیر زبان روشنگرست    لیک عشق بی‌زبان روشنترست
چون قلم اندر نوشتن می‌شتافت    چون به عشق آمد قلم بر خود شکافت
عقل در شرحش چو خر در گل بخفت    شرح عشق و عاشقی هم عشق گفت
آفتاب آمد دلیل آفتاب    گر دلیلت باید از وی رو متاب
از وی ار سایه نشانی می‌دهد    شمس هر دم نور جانی می‌دهد
سایه خواب آرد ترا همچون سمر    چون برآید شمس انشق‌القمر
خود غریبی در جهان چون شمس نیست    شمس جان باقی کش امس نیست
شمس در خارج اگر چه هست فرد    می‌توان هم مثل او تصویر کرد
شمس جان کو خارج آمد از اثیر    نبودش در ذهن و در خارج نظیر
در تصور ذات او را گنج کو    تا درآید در تصور مثل او
چون حدیث روی شمس‌الدین رسید    شمس چارم آسمان سر در کشید
واجب آید چون‌که آمد نام او    شرح کردن رمزی از انعام او
این نفس جان دامنم برتافته‌است    بوی پیراهان یوسف یافته‌است
کز برای حق صحبت سال‌ها    بازگو حالی از آن خوش حال‌ها
تا زمین و آسمان خندان شود    عقل و روح و دیده صد چندان شود
لا تکلفنی فانی فی الفنا    کلت افهامی فلا احصی ثنا
کل شیء قاله غیرالمفیق    ان تکلف او تصلف لا یلیق
من چه گویم یک رگم هشیار نیست    شرح آن یاری که او را یار نیست
شرح این هجران و این خون جگر    این زمان بگذار تا وقت دگر
قال اطعمنی فانی جائع    واعتجل فالوقت سیف قاطع
صوفی ابن‌الوقت باشد ای رفیق    نیست فردا گفتن از شرط طریق
تو مگر خود مرد صوفی نیستی    هست را از نسیه خیزد نیستی
گفتمش پوشیده خوش‌تر سرّ یار    خود تو در ضمن حکایت گوش‌دار
خوش‌تر آن باشد که سرّ دلبران    گفته آید در حدیث دیگران
گفت مکشوف و برهنه بی‌غلول    بازگو دفعم مده ای بوالفضول
پرده بردار و برهنه گو که من    می‌نخسپم با صنم با پیرهن
گفتم ار عریان شود او در عیان    نه تو مانی نه کنارت نه میان
آرزو می‌خواه لیک اندازه خواه    برنتابد کوه را یک برگ کاه
آفتابی کز وی این عالم فروخت    اندکی گر پیش آید جمله سوخت
فتنه و آشوب و خون‌ریزی مجوی    بیش ازین از شمس تبریزی مگوی
این ندارد آخر از آغاز گوی    رو تمام این حکایت بازگوی
`
