
const initial_consonants = {
  'ม': 'm',
  'ณ': 'n',
  'น': 'n',
  'ง': 'q',
  'ป': 'p',
  'ฏ': 't',
  'ต': 't',
  'จ': 'tx̤',
  'ก': 'k',
  'อ': "'",
  'ผ': 'ph',
  'พ': 'ph',
  'ภ': 'ph',
  'ฐ': 'th',
  'ฑ': 'th',
  'ฒ': 'th',
  'ถ': 'th',
  'ท': 'th',
  'ธ': 'th',
  'ฉ': 'tx̤h',
  'ช': 'tx̤h',
  'ฌ': 'tx̤h',
  'ข': 'kh',
  'ฃ': 'kh',
  'ค': 'kh',
  'ฅ': 'kh',
  'ฆ': 'kh',
  'บ': 'b',
  'ฎ': 'd',
  'ด': 'd',
  'ฝ': 'f',
  'ฟ': 'f',
  'ซ': 's',
  'ศ': 's',
  'ษ': 's',
  'ส': 's',
  'ห': 'h',
  'ฮ': 'h',
  'ว': 'w',
  'ล': 'l',
  'ฬ': 'l',
  'ญ': 'y',
  'ย': 'y',
  'ร': 'ŕŕ'
}

const final_consonants = {
  // finals
  'ม': 'm',
  'ญ': 'n',
  'ณ': 'n',
  'น': 'n',
  'ร': 'n',
  'ล': 'n',
  'ฬ': 'n',
  'ง': 'q',
  'บ': 'p',
  'ป': 'p',
  'พ': 'p',
  'ฟ': 'p',
  'ภ': 'p',
  'จ': 't',
  'ช': 't',
  'ซ': 't',
  'ฌ': 't',
  'ฎ': 't',
  'ฏ': 't',
  'ฐ': 't',
  'ฑ': 't',
  'ฒ': 't',
  'ด': 't',
  'ต': 't',
  'ถ': 't',
  'ท': 't',
  'ธ': 't',
  'ศ': 't',
  'ษ': 't',
  'ส': 't',
  'ก': 'k',
  'ข': 'k',
  'ค': 'k',
  'ฆ': 'k',
  'ว': 'w',
  'ย': 'y'
}

if (isWordEnd) {
  out = finals[key]
} else {
  out = initials[key]
}

const vowels = {
  'เ$ะ': 'e',
  'เ$': 'ee',
  'เ-อะ': 'o̤',
  'เ-อ': 'o̤o̤',
  'โ-ะ': 'o',
  'โ-': 'oo',
  'แ-ะ': 'ẹ',
  'แ-': 'ẹẹ',
  'เ-าะ': 'a̤',
  '-อ': 'a̤a̤',
  '-ะ': 'a',
  '\u0E31-': 'a',
  '-า': 'aa',
  '-\u0E34': 'i',
  '-\u0E35': 'ii'
  '-\u0E36': 'ụ',
  '-\u0E37-': 'ụụ',
  '-\u0E38': 'u',
  '-\u0E39': 'uu'
}

const thongs = {
  '–าว': 'aaw',
  'เ–ว': 'eew',
  'แ–ว': 'ẹẹw',
  'เ-\u0E35ยว': 'iaw',
  'เ-\u0E35ย': 'iia',
  '-\u0E31ว': 'uua',
  'เ-\u0E37อ': 'ụụa',
  '–าย': 'aay',
  '–อย': 'a̤a̤y',
  'โ–ย': 'ooy',
  '-\u0E39ย': 'uuy',
  'เ–ย': 'o̤o̤y',
  '–วย': 'uay',
  'เ-\u0E37อย': 'ụay',
  'เ–า': 'aw',
  'เ-\u0E47ว': 'ew',
  '-\u0E34ว': 'iw',
  'เ-\u0E35ยะ': 'ia',
  '-\u0E31วะ': 'ua',
  'เ-\u0E37อะ': 'ụa',
  'ไ–*': 'ay',
  'ใ–*': 'ay',
  'ไ–ย': 'ay',
  '-\u0E31ย': 'ay',
  '-\u0E38ย': 'uy'
}
























