'க': 'k',
'க': 'ɡ',
'க': 'h',
'ங': 'ŋ',
'ச': 'tx',
'ச': 'd͡ʑ',
'ச': 's',
'ஞ': 'ɲ',
'ட': 'ʈ',
'ட': 'ɖ',
'ட': 'ɽ',
'ண': 'ɳ',
'த': 't̪',
'த': 'd̪',
'த': 'ð',
'ந': 'n̪',
'ப': 'p',
'ப': 'b',
'ம': 'm',
'ற': 'r',
'ன': 'n',
'ர': 'ɾ̪',
'ல': 'l̪',
'ள': 'ɭ',
'ழ': 'ɻ',
'ய': 'j',
'வ': 'ʋ',
'ஃ': 'x',
'அ, க': 'a',
'ஆ, கா': 'aː',
'இ, கி': 'i',
'ஈ, கீ': 'iː',
'உ, கு': 'u',
'உ, கு': 'ɯ',
'ஊ, கூ': 'uː',
'எ, கெ': 'e',
'ஏ, கே': 'eː',
'ஐ, கை': 'aɪ̯',
'ஒ, கொ': 'o',
'ஓ, கோ': 'oː',
'ஔ, கௌ': 'aʊ̯',
'ஜ': 'd͡ʒ',
'ஹ': 'h',
'ஸ': 's',
'ஷ': 'ʂ',
'க்ஷ': 'kʂ',
'ஶ': 'ʃ',

 ̃  -ம, -ன





















