
const snake = require('../../../../../../../..')
const assert = require('assert')

const peace_i = `ཞི་བ`

const perf_i = `
༄༅༅། །རྒྱ་གར་སྐད་དུ། ཨཱརྱ་ཨཥྚ་སཱ་ཧ་སྲི་ཀཱ་པྲཛྙཱ་པཱ་ར་མི་ཏཱ། བོད་སྐད་དུ། འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱད་སྟོང་པ།
བམ་པོ་དང་པོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་འཕགས་པ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
།འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཞུགས་ཏེ།
དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དག་དང་ཐབས་ཅིག་གོ། །ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ།
ཉོན་མོངས་པ་མེད་པ། དབང་དུ་གྱུར་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ།
གླང་པོ་ཆེན་པོ། །བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ། ཁུར་བོར་བ། རང་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
ཡང་དག་པར་ཀུན་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཐམས་ཅད་ཀྱི་དབང་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཐོབ་པ་ཤ་སྟག་སྟེ།
གང་ཟག་གཅིག་མ་གཏོགས་པ་ནི་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་
`

describe('tib', () => {

})
