
const ula = require('../../../lib/amharic/geez/ula')
const assert = require('assert')

const poem_i = `
చాంపేయగౌరార్ధశరీరకాయై
కర్పూరగౌరార్ధశరీరకాయ
ధమ్మిల్లకాయై చ జటాధరాయ
నమః శివాయై చ నమః శివాయ

కస్తూరికాకుంకుమచర్చితాయై
చితారజఃపుంజ విచర్చితాయ
కృతస్మరాయై వికృతస్మరాయ
నమః శివాయై చ నమః శివాయ

ఝణత్క్వణత్కంకణనూపురాయై
పాదాబ్జరాజత్ఫణినూపురాయ
హేమాంగదాయై భుజగాంగదాయ
నమః శివాయై చ నమః శివాయ

విశాలనీలోత్పలలోచనాయై
వికాసిపంకేరుహలోచనాయ
సమేక్షణాయై విషమేక్షణాయ
నమః శివాయై చ నమః శివాయ

మందారమాలాకలితాలకాయై
కపాలమాలాంకితకంధరాయ
దివ్యాంబరాయై చ దిగంబరాయ
నమః శివాయై చ నమః శివాయ

అంభోధరశ్యామలకుంతలాయై
తటిత్ప్రభాతామ్రజటాధరాయ
నిరీశ్వరాయై నిఖిలేశ్వరాయ
నమః శివాయై చ నమః శివాయ

ప్రపంచసృష్ట్యున్ముఖలాస్యకాయై
సమస్తసంహారకతాండవాయ
జగజ్జనన్యై జగదేకపిత్రే
నమః శివాయై చ నమః శివాయ

ప్రదీప్తరత్నోజ్జ్వలకుండలాయై
స్ఫురన్మహాపన్నగభూషణాయ
శివాన్వితాయై చ శివాన్వితాయ
నమః శివాయై చ నమః శివాయ

ఏతత్పఠేదష్టకమిష్టదం యో
భక్త్యా స మాన్యో భువి దీర్ఘజీవీ
ప్రాప్నోతి సౌభాగ్యమనంతకాలం
భూయాత్సదా తస్య సమస్తసిద్ధిః
`

const poem_o = ``

describe('telugu', () => {
  describe('telugu', () => {
    describe('ula', () => {
      test('poem', () => {
        assert.equal(ula(poem_i), poem_o)
      })
    })
  })
})
